
#### Terraform Format and Style 🖌`success`

#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```

module.cloudflare_tunnel.cloudflare_zero_trust_tunnel_cloudflared.home_server_k3s: Refreshing state... [id=8f73c5f2-4142-405a-91c6-58892f43ed92]
module.cloudflare_tunnel.data.cloudflare_zero_trust_organization.cf_org: Reading...
module.cloudflare_tunnel.cloudflare_zero_trust_access_group.emma: Refreshing state... [id=7091e53f-4bda-4c0d-94d1-0dd80aea5689]
module.cloudflare_tunnel.cloudflare_zero_trust_access_identity_provider.otp: Refreshing state... [id=8942b532-862c-45a2-9cb2-0722b821fbc3]
module.cloudflare_tunnel.cloudflare_zero_trust_access_identity_provider.google: Refreshing state... [id=dbb8e2c6-c1e6-447d-83c7-016b1ffb946c]
module.cloudflare_tunnel.cloudflare_zero_trust_access_group.faris: Refreshing state... [id=6073b42a-2bb2-47d3-8dc8-b6c43f99523f]
module.cloudflare_tunnel.data.cloudflare_zone.cf_zone: Reading...
module.cloudflare_tunnel.cloudflare_zero_trust_access_group.travis: Refreshing state... [id=e1877b8e-31e3-45d5-bfc1-48201e1903f0]
module.oci_gateway_proxy.data.oci_core_images.ubuntu_2404_arm: Reading...
module.oci_gateway_proxy.data.oci_identity_availability_domain.default_availability_domain: Reading...
module.oci_gateway_proxy.data.oci_core_images.ubuntu_2404_arm: Read complete after 0s [id=CoreImagesDataSource-2126599086]
module.cloudflare_tunnel.cloudflare_zero_trust_access_policy.faris_with_justification: Refreshing state... [id=80666b3b-b639-4530-921b-f87d3caf7603]
module.cloudflare_tunnel.data.cloudflare_zero_trust_organization.cf_org: Read complete after 0s [name=travipross.cloudflareaccess.com]
module.oci_gateway_proxy.data.oci_identity_availability_domain.default_availability_domain: Read complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaazlxasyseddjgh3jqbky5wczzrrvtceefxr7m2oroetxp5b6guvjq]
module.cloudflare_tunnel.data.cloudflare_zone.cf_zone: Read complete after 0s [id=eb4e7f86b844fcda8cbe8a0fb57238ed]
module.cloudflare_tunnel.cloudflare_zero_trust_access_policy.travis_only: Refreshing state... [id=3db950c7-d962-4c48-9bb0-896cdad01ef2]
module.cloudflare_tunnel.cloudflare_zero_trust_access_group.travis_and_emma: Refreshing state... [id=a20a9647-ae1c-48d0-b29b-d7f68c070d91]
module.cloudflare_tunnel.data.cloudflare_zero_trust_tunnel_cloudflared_token.home_server_k3s_token: Reading...
module.cloudflare_tunnel.cloudflare_zero_trust_access_application.zone_wildcard: Refreshing state... [id=d2dfb8c0-b242-4a3e-963f-f40efe11b7d3]
module.cloudflare_tunnel.cloudflare_zero_trust_access_policy.travis_and_emma: Refreshing state... [id=0d42bd9f-2538-45d4-8cc5-f18b1a48e8dc]
module.cloudflare_tunnel.data.cloudflare_zero_trust_tunnel_cloudflared_token.home_server_k3s_token: Read complete after 0s
module.cloudflare_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.home_server_k3s: Refreshing state... [id=8f73c5f2-4142-405a-91c6-58892f43ed92]
module.cloudflare_tunnel.cloudflare_dns_record.apps["Strava"]: Refreshing state... [id=56ec6992210030bbeb7c3a9db5f69a18]
module.cloudflare_tunnel.cloudflare_zero_trust_access_application.apps["Hello World"]: Refreshing state... [id=c42162d5-0a5b-4e6f-a2d0-3e699c080e23]
module.cloudflare_tunnel.cloudflare_dns_record.apps["Hello World"]: Refreshing state... [id=a7ece0b4a7cf67902f7c9e148e094289]
module.cloudflare_tunnel.cloudflare_dns_record.apps["Frigate"]: Refreshing state... [id=de25f4f40abdb3c27c476ba47db5d70d]
module.cloudflare_tunnel.cloudflare_zero_trust_access_application.apps["Frigate"]: Refreshing state... [id=d07af990-9f58-48fe-b92b-019597498b34]
module.cloudflare_tunnel.cloudflare_zero_trust_access_application.apps["Strava"]: Refreshing state... [id=ab9cc0d3-da16-483d-abe5-e543af3d680c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oci_gateway_proxy.oci_core_instance.gateway_proxy will be created
  + resource "oci_core_instance" "gateway_proxy" {
      + availability_domain                 = "IWlk:CA-MONTREAL-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = (sensitive value)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = (known after apply)
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCugLfG3n0LDk3wQjDsQt8ei9uNhSY+Ii6e7Zkdi14AkdTgRstKAoTIA+5VTWyA69Kx+P7fgL09RMhVSFDs8J55EfwdW03317hDIRY94cPghOko3nk0+0t8r2pgL5aH3UQ5WA4Wb2I+RghxR13ZIXy+gjNUbkQaydrs4mWBdY0U4k8kbNczh3HJuXi/WPqq0mqeawanv6iGxjBQMll6rMhYENm1UPw9mHtg0Q6C5FHVioCYDJQ3HorzQs6k1oVZjYfahYM6+5jDymmbdgILdzRoadA/MBCzbUGA5ebD7umCyxFro5hsDhT7vVNG35kfyfpCWIgZbISdj3nLjHYsxVR/ ssh-key-2026-03-22"
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config (known after apply)

      + create_vnic_details {
          + assign_ipv6ip          = (known after apply)
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + private_ip_id          = (known after apply)
          + security_attributes    = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_cidr            = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + resource_management           = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = "50"
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.ca-montreal-1.aaaaaaaayp7wzhn2zdg6c5kckfuuf4qlq57nuydcf2a45c44dxre62imwima"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

  # module.oci_gateway_proxy.oci_core_internet_gateway.gateway_proxy will be created
  + resource "oci_core_internet_gateway" "gateway_proxy" {
      + compartment_id = (sensitive value)
      + defined_tags   = (known after apply)
      + display_name   = "Gateway Proxy Internet Gateway"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.oci_gateway_proxy.oci_core_route_table.gateway_proxy will be created
  + resource "oci_core_route_table" "gateway_proxy" {
      + compartment_id = (sensitive value)
      + defined_tags   = (known after apply)
      + display_name   = "Gateway Proxy Route Table"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.oci_gateway_proxy.oci_core_security_list.gateway_proxy will be created
  + resource "oci_core_security_list" "gateway_proxy" {
      + compartment_id = (sensitive value)
      + defined_tags   = (known after apply)
      + display_name   = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = "All outbound traffic"
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = "HTTP inbound traffic"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
      + ingress_security_rules {
          + description = "HTTPS inbound traffic"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = "ICMP Traffic: 3, 4 (Destination Unreachable: Fragmentation Needed)"
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = "Internal VCN ICMP Traffic: 3 (Destination Unreachable) from within VCN"
          + protocol    = "1"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = "SSH inbound traffic"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = "Tailscale direct connections"
          + protocol    = "17"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = true

          + udp_options {
              + max = 41641
              + min = 41641
            }
        }
    }

  # module.oci_gateway_proxy.oci_core_subnet.gateway_proxy will be created
  + resource "oci_core_subnet" "gateway_proxy" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.0/24"
      + compartment_id             = (sensitive value)
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "Gateway Proxy public subnet"
      + dns_label                  = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.oci_gateway_proxy.oci_core_vcn.gateway_proxy will be created
  + resource "oci_core_vcn" "gateway_proxy" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = "10.0.0.0/16"
      + cidr_blocks                      = (known after apply)
      + compartment_id                   = (sensitive value)
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "Gateway Proxy VCN"
      + dns_label                        = (known after apply)
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + oci_gateway_proxy_instance_public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>